alter table dbo.Attendance
add constraint FK_dbo_Attendance_dbo_Student foreign key (StudentID) references dbo.Student (ID);

alter table dbo.Attendance
add constraint FK_dbo_Attendance_dbo_Shedule foreign key (LessonID) references dbo.Shedule (LessonID);

alter table dbo.Shedule
add constraint FK_dbo_Shedule_dbo_Teacher foreign key (IDTeacher) references dbo.Teacher (ID);

alter table dbo.Shedule
add constraint FK_dbo_Shedule_dbo_Subject foreign key (IDSubject) references dbo.Subjects (ID);

alter table dbo.Student
add constraint FK_dbo_Student_dbo_Groups foreign key (GroupName) references dbo.Groups (Name);

insert into dbo.Groups
values
('3ISP9-31');

INSERT INTO dbo.Subjects (Name)
VALUES
('Математика'),
('Физика'),
('Химия'),
('Биология'),
('Информатика'),
('История'),
('География'),
('Английский язык'),
('Литература'),
('Физическая культура');

INSERT INTO dbo.Teacher (FIO, PasportSerie, PassportNumber, Phone, Address, DateOfBirth)
VALUES
('Иванов Иван Иванович', 'AB', '123456', '8-800-555-35-35', 'г. Москва, ул. Ленина, д. 1', '1985-06-15'),
('Петров Петр Петрович', 'BC', '654321', '8-800-555-35-36', 'г. Санкт-Петербург, ул. Пушкина, д. 3', '1990-12-10'),
('Сидорова Екатерина Александровна', 'CD', '112233', '8-800-555-35-37', 'г. Казань, ул. Горького, д. 2', '1987-04-25'),
('Кузнецов Алексей Дмитриевич', 'DE', '223344', '8-800-555-35-38', 'г. Новосибирск, ул. Карла Маркса, д. 5', '1982-09-14'),
('Михайлова Мария Валерьевна', 'EF', '334455', '8-800-555-35-39', 'г. Екатеринбург, ул. Чехова, д. 7', '1995-01-02'),
('Васильева Наталья Сергеевна', 'FG', '445566', '8-800-555-35-40', 'г. Нижний Новгород, ул. Тимирязева, д. 10', '1992-11-18'),
('Тимофеева Ирина Вячеславовна', 'GH', '556677', '8-800-555-35-41', 'г. Челябинск, ул. Сталеваров, д. 4', '1983-02-22'),
('Зайцева Ольга Викторовна', 'HI', '667788', '8-800-555-35-42', 'г. Ростов-на-Дону, ул. Кировская, д. 12', '1991-07-03'),
('Николаев Дмитрий Юрьевич', 'IJ', '778899', '8-800-555-35-43', 'г. Краснодар, ул. Совхозная, д. 8', '1988-05-19'),
('Лебедева Татьяна Борисовна', 'JK', '889900', '8-800-555-35-44', 'г. Оренбург, ул. Невского, д. 6', '1994-10-30');

INSERT INTO dbo.Student (FIO, PasportSerie, PassportNumber, Phone, Address, DateOfBirth, groupname)
VALUES
('Александров Сергей Викторович', 'AB', '123456', '8-900-555-22-01', 'г. Москва, ул. Тверская, д. 12', '1998-04-22'             ,'3ISP9-31'),
('Петрова Дарина Анатольевна', 'CD', '654321', '8-900-555-22-02', 'г. Санкт-Петербург, ул. Невского, д. 34', '2000-08-10'       ,'3ISP9-31'),
('Иванов Кирилл Михайлович', 'EF', '112233', '8-900-555-22-03', 'г. Казань, ул. Пушкина, д. 56', '1999-01-15'                   ,'3ISP9-31'),
('Смирнова Екатерина Дмитриевна', 'GH', '223344', '8-900-555-22-04', 'г. Новосибирск, ул. Ленина, д. 78', '1997-05-30'          ,'3ISP9-31'),
('Гусев Алексей Андреевич', 'IJ', '334455', '8-900-555-22-05', 'г. Екатеринбург, ул. Карла Маркса, д. 89', '2001-11-01'         ,'3ISP9-31'),
('Михайлова Ольга Владимировна', 'KL', '445566', '8-900-555-22-06', 'г. Нижний Новгород, ул. Пушкина, д. 22', '1999-07-18'      ,'3ISP9-31'),
('Николаев Игорь Павлович', 'MN', '556677', '8-900-555-22-07', 'г. Ростов-на-Дону, ул. Кировская, д. 10', '2000-12-25'          ,'3ISP9-31'),
('Лебедева Татьяна Игоревна', 'OP', '667788', '8-900-555-22-08', 'г. Краснодар, ул. Советская, д. 14', '1998-03-05'             ,'3ISP9-31'),
('Тимофеева Анастасия Александровна', 'QR', '778899', '8-900-555-22-09', 'г. Челябинск, ул. Сталеваров, д. 100', '1997-09-09'   ,'3ISP9-31'),
('Кузнецов Дмитрий Вячеславович', 'ST', '889900', '8-900-555-22-10', 'г. Ростов-на-Дону, ул. Кузнецова, д. 43', '2001-02-12'    ,'3ISP9-31');

INSERT INTO dbo.Shedule (LessonDate, IDTeacher, LessonNum, IDSubject)
VALUES
('2024-03-01', 1, 1, 3),
('2024-03-01', 2, 2, 5),
('2024-03-01', 3, 3, 7),
('2024-03-01', 4, 4, 2),
('2024-03-01', 5, 5, 8),
('2024-03-02', 6, 6, 1),
('2024-03-02', 7, 7, 4),
('2024-03-02', 8, 8, 6),
('2024-03-02', 9, 1, 9),
('2024-03-02', 10, 2, 10),
('2024-03-03', 1, 3, 2),
('2024-03-03', 2, 4, 6),
('2024-03-03', 3, 5, 3),
('2024-03-03', 4, 6, 7),
('2024-03-03', 5, 7, 1),
('2024-03-04', 6, 8, 5),
('2024-03-04', 7, 1, 4),
('2024-03-04', 8, 2, 9),
('2024-03-04', 9, 3, 10),
('2024-03-04', 10, 4, 8),
('2024-03-05', 1, 5, 2),
('2024-03-05', 2, 6, 3),
('2024-03-05', 3, 7, 1),
('2024-03-05', 4, 8, 6),
('2024-03-06', 5, 1, 9),
('2024-03-06', 6, 2, 4),
('2024-03-06', 7, 3, 7),
('2024-03-06', 8, 4, 5),
('2024-03-06', 9, 5, 10),
('2024-03-06', 10, 6, 8),
('2024-03-07', 1, 7, 3),
('2024-03-07', 2, 8, 1),
('2024-03-07', 3, 1, 2),
('2024-03-07', 4, 2, 9),
('2024-03-07', 5, 3, 4),
('2024-03-08', 6, 4, 6),
('2024-03-08', 7, 5, 5),
('2024-03-08', 8, 6, 10),
('2024-03-08', 9, 7, 8),
('2024-03-08', 10, 8, 7),
('2024-03-09', 1, 1, 5),
('2024-03-09', 2, 2, 4),
('2024-03-09', 3, 3, 1),
('2024-03-09', 4, 4, 6),
('2024-03-09', 5, 5, 3),
('2024-03-09', 6, 6, 8),
('2024-03-09', 7, 7, 2),
('2024-03-09', 8, 8, 9),
('2024-03-10', 9, 1, 7),
('2024-03-10', 10, 2, 10),
('2024-03-11', 1, 3, 4),
('2024-03-11', 2, 4, 6),
('2024-03-11', 3, 5, 2),
('2024-03-11', 4, 6, 8),
('2024-03-11', 5, 7, 10),
('2024-03-12', 6, 8, 1),
('2024-03-12', 7, 1, 9),
('2024-03-12', 8, 2, 3),
('2024-03-12', 9, 3, 7),
('2024-03-12', 10, 4, 5),
('2024-03-13', 1, 5, 6),
('2024-03-13', 2, 6, 8),
('2024-03-13', 3, 7, 4),
('2024-03-13', 4, 8, 10),
('2024-03-13', 5, 1, 2),
('2024-03-14', 6, 2, 9),
('2024-03-14', 7, 3, 1),
('2024-03-14', 8, 4, 7),
('2024-03-14', 9, 5, 5),
('2024-03-14', 10, 6, 3),
('2024-03-15', 1, 7, 8),
('2024-03-15', 2, 8, 2),
('2024-03-15', 3, 1, 9),
('2024-03-15', 4, 2, 6),
('2024-03-15', 5, 3, 10),
('2024-03-16', 6, 4, 5),
('2024-03-16', 7, 5, 3),
('2024-03-16', 8, 6, 7),
('2024-03-16', 9, 7, 4),
('2024-03-16', 10, 8, 1);

select * from dbo.shedule